In [1]:
import pyspark
import pandas as pd

## Import data with pandas

In [2]:
data_pd = pd.read_csv('age_data.csv')
data_pd.head()

     Name   Age  Years_Experience  Height  Location_City   Sallary
0    Emma  47.0               4.0    1.68        Chicago  148190.0
1    Noah  73.0               1.0    1.55       New York  225073.0
2  Olivia  32.0               1.0    1.66    Los Angeles  115666.0
3    Liam  75.0              10.0    1.58  San Francisco  103567.0
4     Ava   9.0               1.0    1.96        Chicago  149350.0

## Import data with PySpark

In [3]:
from pyspark.sql import SparkSession

In [4]:
#Create Spark Session Locally. When working in the cloud you can create multiple clusters
spark=SparkSession.builder.appName('Practice').getOrCreate()

23/06/07 09:29:02 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

In [5]:
spark

In [6]:
#Spark can read many options including csv, json, parquet
df_pyspark = spark.read.csv('age_data.csv')

In [7]:
df_pyspark.show(50)

+---------+----+----------------+------+-------------+-------+
|      _c0| _c1|             _c2|   _c3|          _c4|    _c5|
+---------+----+----------------+------+-------------+-------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|  1.60|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|  Abigail|  38|               2|  1.59|      Chicago|   null|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
|     Aria|  78|               4|  1.79|      Chicago| 217043|
| Scarlett|  67|               8|  2.00|     New York| 194911|
| Victoria|  67|               1|  1.85|  Los Angeles|  92620|
|  Madison|  23|               3|  1.87|San Francisco| 195767|
|     Luna|  37|               6|  1.55|      Chicago| 216338|
|    Grace|  22|               8|  1.80|     New York| 212176|
|    Chloe|  22|            null|  1.92|  Los Angeles| 146957|
| Penelope|  58|               9|  1.72|San Francisco| 168719|
|    Layla|  36|               9|  2.01|      Chicago| 141444|
|    Riley|  60|               3|  2.00|     New York| 215036|
|     Zoey|  79|               1|  1.59|  Los Angeles|  80860|
|     Nora|  61|               2|  1.82|San Francisco| 108105|
|     Lily|  35|               3|  1.90|      Chicago|   null|
|  Eleanor|  37|               9|  1.79|     New York| 139093|
|   Hannah|  56|               2|  1.56|  Los Angeles| 222320|
|  Lillian|  73|               3|  1.61|San Francisco| 161724|
|  Addison|  13|               6|  2.02|      Chicago| 174984|
|   Aubrey|  52|               1|  2.01|     New York| 215938|
|    Ellie|  29|               5|  1.63|  Los Angeles| 120808|
|   Stella|  26|               9|  1.62|San Francisco| 123158|
|  Natalie|  14|               7|  1.92|      Chicago| 218458|
|      Zoe|  65|              10|  1.68|     New York| 212527|
|     Leah|null|               7|  1.84|  Los Angeles| 159327|
|    Hazel|  34|               4|  1.62|San Francisco| 131026|
|   Violet|  58|               3|  1.55|      Chicago| 102573|
|   Aurora|  66|              10|  1.55|     New York| 197903|
| Savannah|  49|            null|  1.93|  Los Angeles| 216618|
|   Audrey|  35|               2|  1.99|San Francisco| 206294|
| Brooklyn|  45|               7|  1.55|      Chicago| 109875|
+---------+----+----------------+------+-------------+-------+
only showing top 50 rows

Let's get rid of _c0 and _c1 headers. Try using the option method when importing data.

In [8]:
df_pyspark = spark.read.option('header', 'true').csv('age_data.csv', inferSchema=True)
df_pyspark.show(50)

+---------+----+----------------+------+-------------+-------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|
+---------+----+----------------+------+-------------+-------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|   1.6|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|  Abigail|  38|               2|  1.59|      Chicago|   null|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
|     Aria|  78|               4|  1.79|      Chicago| 217043|
| Scarlett|  67|               8|   2.0|     New York| 194911|
| Victoria|  67|               1|  1.85|  Los Angeles|  92620|
|  Madison|  23|               3|  1.87|San Francisco| 195767|
|     Luna|  37|               6|  1.55|      Chicago| 216338|
|    Grace|  22|               8|   1.8|     New York| 212176|
|    Chloe|  22|            null|  1.92|  Los Angeles| 146957|
| Penelope|  58|               9|  1.72|San Francisco| 168719|
|    Layla|  36|               9|  2.01|      Chicago| 141444|
|    Riley|  60|               3|   2.0|     New York| 215036|
|     Zoey|  79|               1|  1.59|  Los Angeles|  80860|
|     Nora|  61|               2|  1.82|San Francisco| 108105|
|     Lily|  35|               3|   1.9|      Chicago|   null|
|  Eleanor|  37|               9|  1.79|     New York| 139093|
|   Hannah|  56|               2|  1.56|  Los Angeles| 222320|
|  Lillian|  73|               3|  1.61|San Francisco| 161724|
|  Addison|  13|               6|  2.02|      Chicago| 174984|
|   Aubrey|  52|               1|  2.01|     New York| 215938|
|    Ellie|  29|               5|  1.63|  Los Angeles| 120808|
|   Stella|  26|               9|  1.62|San Francisco| 123158|
|  Natalie|  14|               7|  1.92|      Chicago| 218458|
|      Zoe|  65|              10|  1.68|     New York| 212527|
|     Leah|null|               7|  1.84|  Los Angeles| 159327|
|    Hazel|  34|               4|  1.62|San Francisco| 131026|
|   Violet|  58|               3|  1.55|      Chicago| 102573|
|   Aurora|  66|              10|  1.55|     New York| 197903|
| Savannah|  49|            null|  1.93|  Los Angeles| 216618|
|   Audrey|  35|               2|  1.99|San Francisco| 206294|
| Brooklyn|  45|               7|  1.55|      Chicago| 109875|
|    Bella|  79|               7|  1.63|     New York|  78133|
+---------+----+----------------+------+-------------+-------+

Let's look at the data type.

In [9]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

it's a pyspark dataframe. However, many of the same pandas methods still work.

In [10]:
#Prints 5 rows in a list, it's better to use show method
df_pyspark.head(5)

[Row(Name='Emma', Age=47, Years_Experience=4, Height=1.68, Location_City='Chicago', Sallary=148190),
 Row(Name='Noah', Age=73, Years_Experience=1, Height=1.55, Location_City='New York', Sallary=225073),
 Row(Name='Olivia', Age=32, Years_Experience=1, Height=1.66, Location_City='Los Angeles', Sallary=115666),
 Row(Name='Liam', Age=75, Years_Experience=10, Height=1.58, Location_City='San Francisco', Sallary=103567),
 Row(Name='Ava', Age=9, Years_Experience=1, Height=1.96, Location_City='Chicago', Sallary=149350)]

In [11]:
df_pyspark.show()

+---------+----+----------------+------+-------------+-------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|
+---------+----+----------------+------+-------------+-------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|   1.6|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|  Abigail|  38|               2|  1.59|      Chicago|   null|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
+---------+----+----------------+------+-------------+-------+
only showing top 20 rows

.printSchema() is the same as the .info() panadas method

In [12]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Years_Experience: integer (nullable = true)
 |-- Height: double (nullable = true)
 |-- Location_City: string (nullable = true)
 |-- Sallary: integer (nullable = true)

### select certain columns

In [13]:
#Get column names
df_pyspark.columns

['Name', 'Age', 'Years_Experience', 'Height', 'Location_City', 'Sallary']

In [14]:
#Look at individual column
df_pyspark.select('Name').show()

+---------+
|     Name|
+---------+
|     Emma|
|     Noah|
|   Olivia|
|     Liam|
|      Ava|
| Isabella|
|   Sophia|
|      Mia|
|Charlotte|
|   Amelia|
|   Harper|
|   Evelyn|
|  Abigail|
|    Emily|
|Elizabeth|
|     Mila|
|     Ella|
|    Avery|
|    Sofia|
|   Camila|
+---------+
only showing top 20 rows

In [15]:
#Look at two columns

In [16]:
df_pyspark.select(['Name', 'Height']).show()

+---------+------+
|     Name|Height|
+---------+------+
|     Emma|  1.68|
|     Noah|  1.55|
|   Olivia|  1.66|
|     Liam|  1.58|
|      Ava|  1.96|
| Isabella|  1.79|
|   Sophia|  1.95|
|      Mia|  1.79|
|Charlotte|  1.73|
|   Amelia|   1.6|
|   Harper|  1.79|
|   Evelyn|  1.97|
|  Abigail|  1.59|
|    Emily|  1.89|
|Elizabeth|  1.69|
|     Mila|  1.64|
|     Ella|  1.95|
|    Avery|  1.97|
|    Sofia|  2.02|
|   Camila|  1.98|
+---------+------+
only showing top 20 rows

### Check Data Types

In [17]:
df_pyspark.dtypes

[('Name', 'string'),
 ('Age', 'int'),
 ('Years_Experience', 'int'),
 ('Height', 'double'),
 ('Location_City', 'string'),
 ('Sallary', 'int')]

Use the describe funtion to get statistics

In [18]:
df_pyspark.describe().show()

+-------+-------+------------------+-----------------+------------------+-------------+------------------+
|summary|   Name|               Age| Years_Experience|            Height|Location_City|           Sallary|
+-------+-------+------------------+-----------------+------------------+-------------+------------------+
|  count|     50|                48|               47|                50|           50|                48|
|   mean|   null|49.729166666666664| 5.51063829787234|1.7819999999999998|         null|160968.72916666666|
| stddev|   null| 21.03466195464285|3.276214281530039|0.1642670796884992|         null|45620.747785871616|
|    min|Abigail|                 9|                1|              1.55|      Chicago|             78133|
|    max|   Zoey|                80|               10|              2.02|San Francisco|            225073|
+-------+-------+------------------+-----------------+------------------+-------------+------------------+

### Add & Drop & Rename Columns in data frame

In [19]:
#Add extra column called 'experience after 2 years'
df_pyspark = df_pyspark.withColumn('Experience_after_2_years', df_pyspark['Years_Experience']+2)

In [20]:
df_pyspark.show()

+---------+----+----------------+------+-------------+-------+------------------------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|Experience_after_2_years|
+---------+----+----------------+------+-------------+-------+------------------------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|                       6|
|     Noah|  73|               1|  1.55|     New York| 225073|                       3|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|                       3|
|     Liam|  75|              10|  1.58|San Francisco| 103567|                      12|
|      Ava|   9|               1|  1.96|      Chicago| 149350|                       3|
| Isabella|  78|              10|  1.79|     New York| 109479|                      12|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|                       9|
|      Mia|  62|            null|  1.79|San Francisco| 154475|                    null|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|                      12|
|   Amelia|  58|               2|   1.6|     New York| 214669|                       4|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|                       3|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|                       8|
|  Abigail|  38|               2|  1.59|      Chicago|   null|                       4|
|    Emily|  20|               9|  1.89|     New York| 144910|                      11|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|                      12|
|     Mila|  78|              10|  1.64|San Francisco| 139386|                      12|
|     Ella|  29|               5|  1.95|      Chicago| 160033|                       7|
|    Avery|null|              10|  1.97|     New York|  94983|                      12|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|                       9|
|   Camila|  66|               4|  1.98|San Francisco| 188518|                       6|
+---------+----+----------------+------+-------------+-------+------------------------+
only showing top 20 rows

In [21]:
#drop columns
df_pyspark = df_pyspark.drop('Experience_after_2_years')

In [22]:
df_pyspark.show()

+---------+----+----------------+------+-------------+-------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|
+---------+----+----------------+------+-------------+-------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|   1.6|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|  Abigail|  38|               2|  1.59|      Chicago|   null|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
+---------+----+----------------+------+-------------+-------+
only showing top 20 rows

In [23]:
#Rename Columns. I'm not s
df_pyspark.withColumnRenamed('Name','New_Name').show()

+---------+----+----------------+------+-------------+-------+
| New_Name| Age|Years_Experience|Height|Location_City|Sallary|
+---------+----+----------------+------+-------------+-------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|   1.6|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|  Abigail|  38|               2|  1.59|      Chicago|   null|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
+---------+----+----------------+------+-------------+-------+
only showing top 20 rows

## Handling Missing Values
* Drop Columns
* Drop Rows
* Parameters in dropping functionality
* Handle missing values by mean, median , and mode. Imputer function

### Drop Columns and Rows

In [24]:
#Drop age column without saving to new varable
df_pyspark.drop('Age').show()

+---------+----------------+------+-------------+-------+
|     Name|Years_Experience|Height|Location_City|Sallary|
+---------+----------------+------+-------------+-------+
|     Emma|               4|  1.68|      Chicago| 148190|
|     Noah|               1|  1.55|     New York| 225073|
|   Olivia|               1|  1.66|  Los Angeles| 115666|
|     Liam|              10|  1.58|San Francisco| 103567|
|      Ava|               1|  1.96|      Chicago| 149350|
| Isabella|              10|  1.79|     New York| 109479|
|   Sophia|               7|  1.95|  Los Angeles|  97866|
|      Mia|            null|  1.79|San Francisco| 154475|
|Charlotte|              10|  1.73|      Chicago| 199876|
|   Amelia|               2|   1.6|     New York| 214669|
|   Harper|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|               6|  1.97|San Francisco| 171232|
|  Abigail|               2|  1.59|      Chicago|   null|
|    Emily|               9|  1.89|     New York| 144910|
|Elizabeth|              10|  1.69|  Los Angeles| 224057|
|     Mila|              10|  1.64|San Francisco| 139386|
|     Ella|               5|  1.95|      Chicago| 160033|
|    Avery|              10|  1.97|     New York|  94983|
|    Sofia|               7|  2.02|  Los Angeles| 124729|
|   Camila|               4|  1.98|San Francisco| 188518|
+---------+----------------+------+-------------+-------+
only showing top 20 rows

In [26]:
#drop rows based on null value
df_pyspark_dropped_rows = df_pyspark.na.drop()
df_pyspark_dropped_rows.show()

+---------+---+----------------+------+-------------+-------+
|     Name|Age|Years_Experience|Height|Location_City|Sallary|
+---------+---+----------------+------+-------------+-------+
|     Emma| 47|               4|  1.68|      Chicago| 148190|
|     Noah| 73|               1|  1.55|     New York| 225073|
|   Olivia| 32|               1|  1.66|  Los Angeles| 115666|
|     Liam| 75|              10|  1.58|San Francisco| 103567|
|      Ava|  9|               1|  1.96|      Chicago| 149350|
| Isabella| 78|              10|  1.79|     New York| 109479|
|   Sophia| 80|               7|  1.95|  Los Angeles|  97866|
|Charlotte| 61|              10|  1.73|      Chicago| 199876|
|   Amelia| 58|               2|   1.6|     New York| 214669|
|   Harper| 74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn| 53|               6|  1.97|San Francisco| 171232|
|    Emily| 20|               9|  1.89|     New York| 144910|
|Elizabeth| 22|              10|  1.69|  Los Angeles| 224057|
|     Mila| 78|              10|  1.64|San Francisco| 139386|
|     Ella| 29|               5|  1.95|      Chicago| 160033|
|    Sofia| 56|               7|  2.02|  Los Angeles| 124729|
|   Camila| 66|               4|  1.98|San Francisco| 188518|
|     Aria| 78|               4|  1.79|      Chicago| 217043|
| Scarlett| 67|               8|   2.0|     New York| 194911|
| Victoria| 67|               1|  1.85|  Los Angeles|  92620|
+---------+---+----------------+------+-------------+-------+
only showing top 20 rows

In [27]:
#How parameter = all, only drops row if entire row has nulls
#How parameter = any, drop row if any colum has a null
df_pyspark.na.drop(how='any').show()

+---------+---+----------------+------+-------------+-------+
|     Name|Age|Years_Experience|Height|Location_City|Sallary|
+---------+---+----------------+------+-------------+-------+
|     Emma| 47|               4|  1.68|      Chicago| 148190|
|     Noah| 73|               1|  1.55|     New York| 225073|
|   Olivia| 32|               1|  1.66|  Los Angeles| 115666|
|     Liam| 75|              10|  1.58|San Francisco| 103567|
|      Ava|  9|               1|  1.96|      Chicago| 149350|
| Isabella| 78|              10|  1.79|     New York| 109479|
|   Sophia| 80|               7|  1.95|  Los Angeles|  97866|
|Charlotte| 61|              10|  1.73|      Chicago| 199876|
|   Amelia| 58|               2|   1.6|     New York| 214669|
|   Harper| 74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn| 53|               6|  1.97|San Francisco| 171232|
|    Emily| 20|               9|  1.89|     New York| 144910|
|Elizabeth| 22|              10|  1.69|  Los Angeles| 224057|
|     Mila| 78|              10|  1.64|San Francisco| 139386|
|     Ella| 29|               5|  1.95|      Chicago| 160033|
|    Sofia| 56|               7|  2.02|  Los Angeles| 124729|
|   Camila| 66|               4|  1.98|San Francisco| 188518|
|     Aria| 78|               4|  1.79|      Chicago| 217043|
| Scarlett| 67|               8|   2.0|     New York| 194911|
| Victoria| 67|               1|  1.85|  Los Angeles|  92620|
+---------+---+----------------+------+-------------+-------+
only showing top 20 rows

In [30]:
#Threshold - sets how many null values must be present in row before deleting
df_pyspark.na.drop(how='any', thresh=2).show()

+---------+----+----------------+------+-------------+-------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|
+---------+----+----------------+------+-------------+-------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|   1.6|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|  Abigail|  38|               2|  1.59|      Chicago|   null|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
+---------+----+----------------+------+-------------+-------+
only showing top 20 rows

In [31]:
#Subset - specify what columns you want to drop nulls from. Let's try dropping only in the Sallary column
df_pyspark.na.drop(how='any', subset=['Sallary']).show()

+---------+----+----------------+------+-------------+-------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|
+---------+----+----------------+------+-------------+-------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|
|     Noah|  73|               1|  1.55|     New York| 225073|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|
|     Liam|  75|              10|  1.58|San Francisco| 103567|
|      Ava|   9|               1|  1.96|      Chicago| 149350|
| Isabella|  78|              10|  1.79|     New York| 109479|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|
|      Mia|  62|            null|  1.79|San Francisco| 154475|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|
|   Amelia|  58|               2|   1.6|     New York| 214669|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|
|    Emily|  20|               9|  1.89|     New York| 144910|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|
|     Mila|  78|              10|  1.64|San Francisco| 139386|
|     Ella|  29|               5|  1.95|      Chicago| 160033|
|    Avery|null|              10|  1.97|     New York|  94983|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|
|   Camila|  66|               4|  1.98|San Francisco| 188518|
|     Aria|  78|               4|  1.79|      Chicago| 217043|
+---------+----+----------------+------+-------------+-------+
only showing top 20 rows

### Fill missing values

In [35]:
from pyspark.ml.feature import Imputer

#create imputer with mean fill strategy. Specify input and output columns

imputer = Imputer(
    inputCols=['Age', 'Sallary', 'Years_Experience'],
    outputCols=["{}_imputed".format(c) for c in ['Age', 'Sallary', 'Years_Experience']]
    ).setStrategy("mean")
#Can replace mean with median or mode

In [40]:
#fill with mean
df_pyspark_fill_mean = imputer.fit(df_pyspark).transform(df_pyspark)
df_pyspark_fill_mean.show(50)

+---------+----+----------------+------+-------------+-------+-----------+---------------+------------------------+
|     Name| Age|Years_Experience|Height|Location_City|Sallary|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+---------+----+----------------+------+-------------+-------+-----------+---------------+------------------------+
|     Emma|  47|               4|  1.68|      Chicago| 148190|         47|         148190|                       4|
|     Noah|  73|               1|  1.55|     New York| 225073|         73|         225073|                       1|
|   Olivia|  32|               1|  1.66|  Los Angeles| 115666|         32|         115666|                       1|
|     Liam|  75|              10|  1.58|San Francisco| 103567|         75|         103567|                      10|
|      Ava|   9|               1|  1.96|      Chicago| 149350|          9|         149350|                       1|
| Isabella|  78|              10|  1.79|     New York| 109479|         78|         109479|                      10|
|   Sophia|  80|               7|  1.95|  Los Angeles|  97866|         80|          97866|                       7|
|      Mia|  62|            null|  1.79|San Francisco| 154475|         62|         154475|                       5|
|Charlotte|  61|              10|  1.73|      Chicago| 199876|         61|         199876|                      10|
|   Amelia|  58|               2|   1.6|     New York| 214669|         58|         214669|                       2|
|   Harper|  74|               1|  1.79|  Los Angeles| 179705|         74|         179705|                       1|
|   Evelyn|  53|               6|  1.97|San Francisco| 171232|         53|         171232|                       6|
|  Abigail|  38|               2|  1.59|      Chicago|   null|         38|         160968|                       2|
|    Emily|  20|               9|  1.89|     New York| 144910|         20|         144910|                       9|
|Elizabeth|  22|              10|  1.69|  Los Angeles| 224057|         22|         224057|                      10|
|     Mila|  78|              10|  1.64|San Francisco| 139386|         78|         139386|                      10|
|     Ella|  29|               5|  1.95|      Chicago| 160033|         29|         160033|                       5|
|    Avery|null|              10|  1.97|     New York|  94983|         49|          94983|                      10|
|    Sofia|  56|               7|  2.02|  Los Angeles| 124729|         56|         124729|                       7|
|   Camila|  66|               4|  1.98|San Francisco| 188518|         66|         188518|                       4|
|     Aria|  78|               4|  1.79|      Chicago| 217043|         78|         217043|                       4|
| Scarlett|  67|               8|   2.0|     New York| 194911|         67|         194911|                       8|
| Victoria|  67|               1|  1.85|  Los Angeles|  92620|         67|          92620|                       1|
|  Madison|  23|               3|  1.87|San Francisco| 195767|         23|         195767|                       3|
|     Luna|  37|               6|  1.55|      Chicago| 216338|         37|         216338|                       6|
|    Grace|  22|               8|   1.8|     New York| 212176|         22|         212176|                       8|
|    Chloe|  22|            null|  1.92|  Los Angeles| 146957|         22|         146957|                       5|
| Penelope|  58|               9|  1.72|San Francisco| 168719|         58|         168719|                       9|
|    Layla|  36|               9|  2.01|      Chicago| 141444|         36|         141444|                       9|
|    Riley|  60|               3|   2.0|     New York| 215036|         60|         215036|                       3|
|     Zoey|  79|               1|  1.59|  Los Angeles|  80860|         79|          80860|                       1|
|     Nora|  61|               2|  1.82|San Francisco| 108105|         61|         108105|                       2|
|     Lily|  35|               3|   1.9|      Chicago|   null|         35|         160968|                       3|
|  Eleanor|  37|               9|  1.79|     New York| 139093|         37|         139093|                       9|
|   Hannah|  56|               2|  1.56|  Los Angeles| 222320|         56|         222320|                       2|
|  Lillian|  73|               3|  1.61|San Francisco| 161724|         73|         161724|                       3|
|  Addison|  13|               6|  2.02|      Chicago| 174984|         13|         174984|                       6|
|   Aubrey|  52|               1|  2.01|     New York| 215938|         52|         215938|                       1|
|    Ellie|  29|               5|  1.63|  Los Angeles| 120808|         29|         120808|                       5|
|   Stella|  26|               9|  1.62|San Francisco| 123158|         26|         123158|                       9|
|  Natalie|  14|               7|  1.92|      Chicago| 218458|         14|         218458|                       7|
|      Zoe|  65|              10|  1.68|     New York| 212527|         65|         212527|                      10|
|     Leah|null|               7|  1.84|  Los Angeles| 159327|         49|         159327|                       7|
|    Hazel|  34|               4|  1.62|San Francisco| 131026|         34|         131026|                       4|
|   Violet|  58|               3|  1.55|      Chicago| 102573|         58|         102573|                       3|
|   Aurora|  66|              10|  1.55|     New York| 197903|         66|         197903|                      10|
| Savannah|  49|            null|  1.93|  Los Angeles| 216618|         49|         216618|                       5|
|   Audrey|  35|               2|  1.99|San Francisco| 206294|         35|         206294|                       2|
| Brooklyn|  45|               7|  1.55|      Chicago| 109875|         45|         109875|                       7|
|    Bella|  79|               7|  1.63|     New York|  78133|         79|          78133|                       7|
+---------+----+----------------+------+-------------+-------+-----------+---------------+------------------------+

Let's drop the original columns to clean up the dataframe.

In [41]:
df_pyspark_fill_mean = df_pyspark_fill_mean.drop('Age', 'Sallary', 'Years_Experience')
df_pyspark_fill_mean.show()

+---------+------+-------------+-----------+---------------+------------------------+
|     Name|Height|Location_City|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+---------+------+-------------+-----------+---------------+------------------------+
|     Emma|  1.68|      Chicago|         47|         148190|                       4|
|     Noah|  1.55|     New York|         73|         225073|                       1|
|   Olivia|  1.66|  Los Angeles|         32|         115666|                       1|
|     Liam|  1.58|San Francisco|         75|         103567|                      10|
|      Ava|  1.96|      Chicago|          9|         149350|                       1|
| Isabella|  1.79|     New York|         78|         109479|                      10|
|   Sophia|  1.95|  Los Angeles|         80|          97866|                       7|
|      Mia|  1.79|San Francisco|         62|         154475|                       5|
|Charlotte|  1.73|      Chicago|         61|         199876|                      10|
|   Amelia|   1.6|     New York|         58|         214669|                       2|
|   Harper|  1.79|  Los Angeles|         74|         179705|                       1|
|   Evelyn|  1.97|San Francisco|         53|         171232|                       6|
|  Abigail|  1.59|      Chicago|         38|         160968|                       2|
|    Emily|  1.89|     New York|         20|         144910|                       9|
|Elizabeth|  1.69|  Los Angeles|         22|         224057|                      10|
|     Mila|  1.64|San Francisco|         78|         139386|                      10|
|     Ella|  1.95|      Chicago|         29|         160033|                       5|
|    Avery|  1.97|     New York|         49|          94983|                      10|
|    Sofia|  2.02|  Los Angeles|         56|         124729|                       7|
|   Camila|  1.98|San Francisco|         66|         188518|                       4|
+---------+------+-------------+-----------+---------------+------------------------+
only showing top 20 rows

## Filter Operations
This is important for data preprocessiong, if you want to retreive data based on a set of conditions.
* filter operations
* &, |, ==
* ~

Let's find the salary of people equal or less than $120,000

In [45]:
df_pyspark_fill_mean.filter("Sallary_imputed <= 120000").show()

+--------+------+-------------+-----------+---------------+------------------------+
|    Name|Height|Location_City|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+--------+------+-------------+-----------+---------------+------------------------+
|  Olivia|  1.66|  Los Angeles|         32|         115666|                       1|
|    Liam|  1.58|San Francisco|         75|         103567|                      10|
|Isabella|  1.79|     New York|         78|         109479|                      10|
|  Sophia|  1.95|  Los Angeles|         80|          97866|                       7|
|   Avery|  1.97|     New York|         49|          94983|                      10|
|Victoria|  1.85|  Los Angeles|         67|          92620|                       1|
|    Zoey|  1.59|  Los Angeles|         79|          80860|                       1|
|    Nora|  1.82|San Francisco|         61|         108105|                       2|
|  Violet|  1.55|      Chicago|         58|         102573|                       3|
|Brooklyn|  1.55|      Chicago|         45|         109875|                       7|
|   Bella|  1.63|     New York|         79|          78133|                       7|
+--------+------+-------------+-----------+---------------+------------------------+

Let's select the name and age from this subset.

In [47]:
df_pyspark_fill_mean.filter("Sallary_imputed <= 120000").select("Name", "Age_imputed").show()

+--------+-----------+
|    Name|Age_imputed|
+--------+-----------+
|  Olivia|         32|
|    Liam|         75|
|Isabella|         78|
|  Sophia|         80|
|   Avery|         49|
|Victoria|         67|
|    Zoey|         79|
|    Nora|         61|
|  Violet|         58|
|Brooklyn|         45|
|   Bella|         79|
+--------+-----------+

Let's filter for two conditions using and operator

In [54]:
df_pyspark_fill_mean.filter((df_pyspark_fill_mean['Sallary_imputed'] <= 150000) & 
                            (df_pyspark_fill_mean['Sallary_imputed'] > 100000)).show()

+--------+------+-------------+-----------+---------------+------------------------+
|    Name|Height|Location_City|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+--------+------+-------------+-----------+---------------+------------------------+
|    Emma|  1.68|      Chicago|         47|         148190|                       4|
|  Olivia|  1.66|  Los Angeles|         32|         115666|                       1|
|    Liam|  1.58|San Francisco|         75|         103567|                      10|
|     Ava|  1.96|      Chicago|          9|         149350|                       1|
|Isabella|  1.79|     New York|         78|         109479|                      10|
|   Emily|  1.89|     New York|         20|         144910|                       9|
|    Mila|  1.64|San Francisco|         78|         139386|                      10|
|   Sofia|  2.02|  Los Angeles|         56|         124729|                       7|
|   Chloe|  1.92|  Los Angeles|         22|         146957|                       5|
|   Layla|  2.01|      Chicago|         36|         141444|                       9|
|    Nora|  1.82|San Francisco|         61|         108105|                       2|
| Eleanor|  1.79|     New York|         37|         139093|                       9|
|   Ellie|  1.63|  Los Angeles|         29|         120808|                       5|
|  Stella|  1.62|San Francisco|         26|         123158|                       9|
|   Hazel|  1.62|San Francisco|         34|         131026|                       4|
|  Violet|  1.55|      Chicago|         58|         102573|                       3|
|Brooklyn|  1.55|      Chicago|         45|         109875|                       7|
+--------+------+-------------+-----------+---------------+------------------------+

In [55]:
#Filter using or operator
df_pyspark_fill_mean.filter((df_pyspark_fill_mean['Sallary_imputed'] <= 150000) | 
                            (df_pyspark_fill_mean['Sallary_imputed'] > 100000)).show()

+---------+------+-------------+-----------+---------------+------------------------+
|     Name|Height|Location_City|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+---------+------+-------------+-----------+---------------+------------------------+
|     Emma|  1.68|      Chicago|         47|         148190|                       4|
|     Noah|  1.55|     New York|         73|         225073|                       1|
|   Olivia|  1.66|  Los Angeles|         32|         115666|                       1|
|     Liam|  1.58|San Francisco|         75|         103567|                      10|
|      Ava|  1.96|      Chicago|          9|         149350|                       1|
| Isabella|  1.79|     New York|         78|         109479|                      10|
|   Sophia|  1.95|  Los Angeles|         80|          97866|                       7|
|      Mia|  1.79|San Francisco|         62|         154475|                       5|
|Charlotte|  1.73|      Chicago|         61|         199876|                      10|
|   Amelia|   1.6|     New York|         58|         214669|                       2|
|   Harper|  1.79|  Los Angeles|         74|         179705|                       1|
|   Evelyn|  1.97|San Francisco|         53|         171232|                       6|
|  Abigail|  1.59|      Chicago|         38|         160968|                       2|
|    Emily|  1.89|     New York|         20|         144910|                       9|
|Elizabeth|  1.69|  Los Angeles|         22|         224057|                      10|
|     Mila|  1.64|San Francisco|         78|         139386|                      10|
|     Ella|  1.95|      Chicago|         29|         160033|                       5|
|    Avery|  1.97|     New York|         49|          94983|                      10|
|    Sofia|  2.02|  Los Angeles|         56|         124729|                       7|
|   Camila|  1.98|San Francisco|         66|         188518|                       4|
+---------+------+-------------+-----------+---------------+------------------------+
only showing top 20 rows

In [58]:
#People making more than 150,000 in Chicago
df_pyspark_fill_mean.filter((df_pyspark_fill_mean['Sallary_imputed'] > 150000) & 
                            (df_pyspark_fill_mean['Location_City'] == 'Chicago')).show()

+---------+------+-------------+-----------+---------------+------------------------+
|     Name|Height|Location_City|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+---------+------+-------------+-----------+---------------+------------------------+
|Charlotte|  1.73|      Chicago|         61|         199876|                      10|
|  Abigail|  1.59|      Chicago|         38|         160968|                       2|
|     Ella|  1.95|      Chicago|         29|         160033|                       5|
|     Aria|  1.79|      Chicago|         78|         217043|                       4|
|     Luna|  1.55|      Chicago|         37|         216338|                       6|
|     Lily|   1.9|      Chicago|         35|         160968|                       3|
|  Addison|  2.02|      Chicago|         13|         174984|                       6|
|  Natalie|  1.92|      Chicago|         14|         218458|                       7|
+---------+------+-------------+-----------+---------------+------------------------+

In [62]:
#Try filtering with 'not condition'. People who at NOT making more than 150,000
df_pyspark_fill_mean.filter(~(df_pyspark_fill_mean['Sallary_imputed'] > 150000)).show(50)

+--------+------+-------------+-----------+---------------+------------------------+
|    Name|Height|Location_City|Age_imputed|Sallary_imputed|Years_Experience_imputed|
+--------+------+-------------+-----------+---------------+------------------------+
|    Emma|  1.68|      Chicago|         47|         148190|                       4|
|  Olivia|  1.66|  Los Angeles|         32|         115666|                       1|
|    Liam|  1.58|San Francisco|         75|         103567|                      10|
|     Ava|  1.96|      Chicago|          9|         149350|                       1|
|Isabella|  1.79|     New York|         78|         109479|                      10|
|  Sophia|  1.95|  Los Angeles|         80|          97866|                       7|
|   Emily|  1.89|     New York|         20|         144910|                       9|
|    Mila|  1.64|San Francisco|         78|         139386|                      10|
|   Avery|  1.97|     New York|         49|          94983|                      10|
|   Sofia|  2.02|  Los Angeles|         56|         124729|                       7|
|Victoria|  1.85|  Los Angeles|         67|          92620|                       1|
|   Chloe|  1.92|  Los Angeles|         22|         146957|                       5|
|   Layla|  2.01|      Chicago|         36|         141444|                       9|
|    Zoey|  1.59|  Los Angeles|         79|          80860|                       1|
|    Nora|  1.82|San Francisco|         61|         108105|                       2|
| Eleanor|  1.79|     New York|         37|         139093|                       9|
|   Ellie|  1.63|  Los Angeles|         29|         120808|                       5|
|  Stella|  1.62|San Francisco|         26|         123158|                       9|
|   Hazel|  1.62|San Francisco|         34|         131026|                       4|
|  Violet|  1.55|      Chicago|         58|         102573|                       3|
|Brooklyn|  1.55|      Chicago|         45|         109875|                       7|
|   Bella|  1.63|     New York|         79|          78133|                       7|
+--------+------+-------------+-----------+---------------+------------------------+

## GroupBy and Agregate Functions

In [64]:
#Load new dataset
df_pyspark = spark.read.option('header', 'true').csv('department_data.csv', inferSchema=True)
df_pyspark.show()

+---------+----+------------+-------+
|     Name| Age|  Department|Sallary|
+---------+----+------------+-------+
|     Emma|  29|         IoT| 113938|
|     Noah|  47|Data Science| 193905|
|   Olivia|  35|          IT| 125014|
|     Liam|   9|     Support| 134964|
|      Ava|  64|     Backend| 157453|
| Isabella|  24|    Frontend|  94749|
|   Sophia|  39|         IoT|  82228|
|      Mia|  16|Data Science| 171357|
|Charlotte|  68|          IT| 124426|
|   Amelia|  38|     Support| 127667|
|   Harper|  63|     Backend|  98063|
|   Evelyn|  43|    Frontend| 119494|
|  Abigail|  66|         IoT|   null|
|    Emily|  73|Data Science| 128182|
|Elizabeth|  60|          IT| 168372|
|     Mila|  14|     Support| 164825|
|     Ella|  46|     Backend| 179306|
|    Avery|null|    Frontend| 131310|
|    Sofia|  80|         IoT| 220873|
|   Camila|  10|Data Science|  94252|
+---------+----+------------+-------+
only showing top 20 rows

### GroupBy

In [77]:
#What department cost the most (has highest total salary). Drop the summed Age column
df_pyspark.groupBy('Department').sum().drop('sum(Age)').show()

+------------+------------+
|  Department|sum(Sallary)|
+------------+------------+
|    Frontend|     1131719|
|         IoT|     1276485|
|          IT|      878871|
|     Support|     1105691|
|     Backend|     1229310|
|Data Science|     1279569|
+------------+------------+

In [80]:
#What department has the highest mean salary?
df_pyspark.groupBy('Department').mean().drop('avg(Age)').show()

+------------+------------------+
|  Department|      avg(Sallary)|
+------------+------------------+
|    Frontend|        141464.875|
|         IoT|        159560.625|
|          IT|          125553.0|
|     Support|        138211.375|
|     Backend|         153663.75|
|Data Science|142174.33333333334|
+------------+------------------+

In [81]:
#How many employees work in each department
df_pyspark.groupBy('Department').count().show()

+------------+-----+
|  Department|count|
+------------+-----+
|    Frontend|    8|
|         IoT|    9|
|          IT|    8|
|     Support|    8|
|     Backend|    8|
|Data Science|    9|
+------------+-----+

In [82]:
#What's the total salary
df_pyspark.agg({'Sallary':'sum'}).show()

+------------+
|sum(Sallary)|
+------------+
|     6901645|
+------------+